miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_hdriver.c
/******************************************************************************
 Function Name   : usb_hstd_suspend_complete
 Description     : usb_hstd_change_device_state callback (Suspend)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t data1   : Not used.
                 : uint16_t data2   : Not used.
 Return value    : none
 ******************************************************************************/
void usb_hstd_suspend_complete (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;
    
    g_usb_change_device_state[ptr->ip] &= (~(1 << USB_STS_SUSPEND));

    ctrl.module     = ptr->ip;      /* USB Module Number */
    ctrl.address    = 1;            /* Device Address Number */

    usb_set_event(USB_STS_SUSPEND, &ctrl);
}
/******************************************************************************
 End of function usb_hstd_suspend_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_resume_complete
 Description     : usb_hstd_change_device_state callback (Resume)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t data1   : Not used.
                 : uint16_t data2   : Not used.
 Return value    : none
 ******************************************************************************/
void usb_hstd_resume_complete (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    g_usb_change_device_state[ptr->ip] &= (~(1 << USB_STS_RESUME));

    ctrl.module     = ptr->ip;
    ctrl.address    = 1;

    usb_set_event(USB_STS_RESUME, &ctrl);
}/* End of function usb_hstd_resume_complete */


/******************************************************************************
 Function Name  : usb_hstd_device_information
 Description    : Get the status of the connected USB Device
 Arguments      : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                : uint16_t devaddr  : Device address
                : uint16_t *tbl     : Table Pointer
 Return         : None
******************************************************************************/
void usb_hstd_device_information (usb_utr_t *ptr, uint16_t devaddr, uint16_t *tbl)
{
    uint16_t    i, port, *p;

    if( devaddr == 0 )
    {
        for( p = tbl, i = 0; i < 8; ++i )
        {
            *p++ = USB_NOPORT;
        }

        port = g_usb_hstd_device_info[ptr->ip][devaddr][0];
        tbl[0] = port;
        tbl[1] = g_usb_hstd_mgr_mode[ptr->ip];
        tbl[4] = g_usb_hstd_device_info[ptr->ip][devaddr][4];

    }
    else
    {
        for( i = 0; i < 8; ++i )
        {
            tbl[i] = g_usb_hstd_device_info[ptr->ip][devaddr][i];
        }
    }
    tbl[8] = g_usb_hstd_mgr_mode[ptr->ip];
}
/******************************************************************************
 End of function usb_hstd_device_information
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_host_registration
 Description     : sample registration.
 Argument        : usb_utr_t    *ptr   : Pointer to usb_utr_t structure.
 Return          : none
 ******************************************************************************/
void usb_host_registration (usb_utr_t *ptr)
{

#if defined(USB_CFG_HCDC_USE)
    usb_hcdc_registration(ptr);

#endif /* defined(USB_CFG_PCDC_USE) */

#if defined(USB_CFG_HHID_USE)
    usb_hhid_registration(ptr);

#endif /* defined(USB_CFG_HMSC_USE) */

#if defined(USB_CFG_HMSC_USE)
    usb_hmsc_registration(ptr);

#endif /* defined(USB_CFG_HMSC_USE) */

#if defined(USB_CFG_HVND_USE)
    usb_hvendor_registration(ptr);

#endif /* defined(USB_CFG_HVND_USE) */
}
/******************************************************************************
 End of function usb_host_registration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_transfer_start
 Description     : Send a request for data transfer to HCD (Host Control Driver) 
                 : using the specified pipe.
 Arguments       : usb_utr_t *ptr : Pointer to usb_utr_t structure.
 Return          : usb_er_t       : USB_OK/USB_QOVR/USB_ERROR
 ******************************************************************************/
usb_er_t usb_hstd_transfer_start (usb_utr_t *ptr)
{
    usb_er_t        err;

    /* Check enumeration  */
    if( ptr->keyword == USB_PIPE0 )
    {
        if (USB_DEFAULT == g_usb_hstd_mgr_mode[ptr->ip])
        {
            return USB_QOVR;
        }
    }

    err = usb_hstd_transfer_start_req( ptr );

    return err;
}
/******************************************************************************
 End of function usb_hstd_transfer_start
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_connect_err_event_set
 Description     : Set event for "USB_STS_NOT_SUPPORT"
 Arguments       : uint16_t ip_no  : IP no.(USB_IP0/USB_IP1)
 Return          : none
 ******************************************************************************/
void usb_hstd_connect_err_event_set(uint16_t ip_no)
{
    usb_ctrl_t ctrl;

    ctrl.address = g_usb_hstd_device_addr[ip_no];       /* usb device address */
    ctrl.module = ip_no;                                /* module number setting */
    usb_set_event(USB_STS_NOT_SUPPORT, &ctrl);          /* set event()  */
}
/******************************************************************************
 End of function usb_hstd_connect_err_event_set
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End  Of File
 ******************************************************************************/

